/* Short description, must be kept short after localization - displayed when agent could not be found on the phone */
"Agent not found" = "Agenttia ei löytynyt";

/* No comment provided by engineer. */
"Agent on phone sent a chunk with an incorrect length." = "Puhelimen agentti lähetti väärän pituisen lohkon.";

/* No comment provided by engineer. */
"Agent on phone sent a malformed message." = "Puhelimen agentti lähetti väärin muodostetun viestin.";

/* No comment provided by engineer. */
"Agent on phone sent an unexpected message body." = "Puhelimen agentti lähetti odottamattoman viestivartalon.";

/* No comment provided by engineer. */
"Agent on phone sent an unexpected message type." = "Puhelimen agentti lähetti odottamattoman viestityypin.";

/* No comment provided by engineer. */
"Agent on phone sent an unexpected value for message header %@." = "Puhelimen agentti lähetti odottamattoman arvon viestin otsakkeelle %@.";

/* No comment provided by engineer. */
"Agent on phone sent no message while we were expecting one." = "Puhelimen agentti ei lähettänyt viestiä vaikka viestiä odotettiin.";

/* generic error displayed when PIM sync fails due to a communication failure (contacts only) */
"An communication error occurred during the synchronization." = "Synkronoinnin aikana tapahtui tietoliikennevirhe.";

/* displayed when calendars synchronization failed */
"An error occurred while synchronizing your calendars with the phone." = "Synkronoitaessa kalentereita puhelimeen tapahtui virhe.";

/* displayed when contacts and calendars synchronization failed */
"An error occurred while synchronizing your contacts and calendars with the phone." = "Synkronoitaessa yhteystietoja ja kalentereita puhelimeen tapahtui virhe.";

/* displayed when contacts synchronization failed */
"An error occurred while synchronizing your contacts with the phone." = "Synkronoitaessa yhteystietoja puhelimeen tapahtui virhe.";

/* error displayed when the Macintosh sync server could not be reached. */
"An error occurred while talk the Sync Server on your computer." = "Viestittäessä tietokoneen synkronointipalvelimen kanssa tapahtui virhe.";

/* low-level technical error */
"An exception occurred while synchronizing." = "Synkronoitaessa tapahtui poikkeus.";

/* generic error */
"An unexpected error occured." = "Tapahtui odottamaton virhe.";

/* Low level phone error */
"AT Command\\U2019s response parse error" = "AT-komennon vastauksen jäsennysvirhe";

/* Low level phone error */
"AT Operation to prepare channel has incorrect properties" = "Kanavan valmistelevan AT-operaation ominaisuudet ovat virheellisiä";

/* displayed when we detect the phone is not equiped with bluetooth */
"Bluetooth is not available on this computer." = "Tietokonessa ei ole Bluetooth-ominaisuutta.";

/* Short description, must be kept short after localization - displayed when we detect bluetooth is on on the mac */
"Bluetooth is off" = "Bluetooth on pois käytöstä";

/* Short description, must be kept short after localization - displayed when we detect bluetooth is off on the computer */
"Bluetooth is turned off on your computer." = "Tietokoneen Bluetooth-ominaisuus on pois käytöstä.";

/* Short description, must be kept short after localization - displayed when we detect the phone is not equiped with bluetooth */
"Bluetooth not available" = "Bluetooth ei ole käytettävissä";

/* Short description, must be kept short after localization - generic error displayed when PIM sync fails (contacts only) */
"Calendar synchronization failed" = "Kalenterin synkronointi epäonnistui";

/* Short description, must be kept short after localization - displayed when calendars synchronization failed */
"Calendars synchronization failed" = "Kalentereiden synkronointi epäonnistui";

/* low level error */
"Can\\U2019t connect in middle of disconnection process." = "Yhteyttä ei voida muodostaa yhteyden katkaisemisen ollessa meneillään.";

/* displayed when phone memory card was not found */
"Can\\U2019t find memory card on phone." = "Puhelimesta ei löydy muistikorttia.";

/* No comment provided by engineer. */
"Cannot connect to the sync server" = "Yhteyttä synkronointipalvelimeen ei voida muodostaa";

/* No comment provided by engineer. */
"Cannot get changes from the SyncServer, the session may have been canceled." = "Synkronointipalvelimelta ei saada muutoksia; istunto on ehkä kumottu.";

/* Unfrequent error */
"Cannot register the phone for synchronization." = "Puhelinta ei voida rekisteröidä synkronointia varten.";

/* No comment provided by engineer. */
"Change can\\U2019t be send to the phone" = "Muutosta ei voida lähettää puhelimeen";

/* a modification comes from the phone for records that are read only. NOTE: %@ is one of the following: [events in a read only calendar | all-day events] (occurs during pim sync) */
"Changing %@ on the phone is not allowed. These changes have been ignored:" = "%@ muuttaminen puhelimessa ei ole sallittua. Nämä muutokset on jätetty huomioimatta:";

/* recovery suggestion displayed when a message could not be sent */
"Check the phone network or the message recipient." = "Tarkista puhelinverkko tai viestin vastaanottaja.";

/* Short description, must be kept short after localization - error displayed when the physical connection was lost while synchronizing the phone. */
"Communication error" = "Tietoliikennevirhe";

/* Short description, must be kept short after localization - displayed when connection to the phone could not be established because it is already in use */
"Connection busy" = "Yhteys on varattu";

/* Short description, must be kept short after localization - displayed when connection to the phone was closed unexpectedly */
"Connection closed unexpectedly" = "Yhteys katkesi yllättäen";

/* Short description, must be kept short after localization - displayed when connection to the phone could not be established because it was refused */
"Connection denied" = "Yhteys estettiin";

/* displayed when PIM sync failed because phone could not be reached. */
"Connection to the phone failed." = "Yhteyden muodostaminen puhelimeen epäonnistui.";

/* displayed when connection to the phone was closed unexpectedly */
"Connection to the phone was closed unexpectedly." = "Yhteys puhelimeen katkesi yllättäen.";

/* Short description, must be kept short after localization - generic error displayed when PIM sync fails (contacts only) */
"Contact synchronization failed" = "Yhteystietojen synkronointi epäonnistui";

/* Short description, must be kept short after localization - displayed when contacts and calendars synchronization failed */
"Contacts and calendars synchronization failed" = "Yhteystietojen ja kalentereiden synkronointi epäonnistui";

/* Short description, must be kept short after localization - displayed when contacts synchronization failed */
"Contacts synchronization failed" = "Yhteystietojen synkronointi epäonnistui";

/* Short description, must be kept short after localization - error displayed when PIM sync failed because phone could not be reached. */
"Could not connect to the phone" = "Puhelimeen ei voitu muodostaa yhteyttä";

/* displayed when connection to the phone could not be established because it is already in use */
"Could not connect to the phone. Another application is already connected to the phone." = "Puhelimeen ei voitu muodostaa yhteyttä. Toinen ohjelma on jo yhteydessä puhelimeen.";

/* displayed when connection to the phone could not be established because it was refused */
"Could not connect to the phone. Connection was denied." = "Puhelimeen ei voitu muodostaa yhteyttä. Yhteys estettiin.";

/* displayed when connection to the phone could not be established */
"Could not connect to the phone. Phone not found." = "Puhelimeen ei voitu muodostaa yhteyttä. Puhelinta ei löytynyt.";

/* Short description, must be kept short after localization - error displayed when an error occurs while deleting contacts and calendars on the phone during a PIM sync */
"Delete failed" = "Poistaminen epäonnistui";

/* displayed when PIM sync failed because the phone is busy or because the synchronization was cancelled on the phone. */
"Device is not available or synchronization was cancelled. Close dialogs and applications on the phone and try again." = "Laite ei ole käytettävissä tai synkronointi peruttiin. Sulje puhelimen valintataulut ja ohjelmat ja yritä uudelleen.";

/* displayed when trying to create a directory on the phone that already exists */
"Directory already exists." = "Hakemisto on jo olemassa.";

/* Short description, must be kept short after localization - displayed when an error occured while accessing phone internal memory */
"Error while accessing phone memory." = "Käytettäessä puhelimen muistia tapahtui virhe.";

/* Short description, must be kept short after localization - generic error displayed when deletion of all record during sync fails (contacts only) */
"Error while erasing calendar events" = "Poistettaessa kalenteritapahtumia tapahtui virhe";

/* Short description, must be kept short after localization - generic error displayed when deletion of all record during sync fails (contacts only) */
"Error while erasing contacts" = "Poistettaessa yhteystietoja tapahtui virhe";

/* Short description, must be kept short after localization - generic error displayed when deletion of all record during sync fails (contacts and calendars) */
"Error while erasing contacts and calendar events" = "Poistettaessa yhteystietoja ja kalenteritapahtumia tapahtui virhe";

/* Short description, must be kept short after localization - generic error displayed when erasing of all record during sync fails (contacts only) */
"Error while erasing some calendar events" = "Poistettaessa joitakin kalenteritapahtumia tapahtui virhe";

/* Short description, must be kept short after localization - generic error displayed when erasing some records during sync fails (contacts only) */
"Error while erasing some contacts" = "Poistettaessa joitakin yhteystietoja tapahtui virhe";

/* Short description, must be kept short after localization - generic error displayed when erasing some record during sync fails (contacts and calendars) */
"Error while erasing some contacts and calendar events" = "Poistettaessa joitakin yhteystietoja ja kalenteritapahtumia tapahtui virhe";

/* Short description, must be kept short after localization - generic error displayed when sync fails while getting records from phone (contacts only) */
"Error while getting all calendar." = "Haettaessa kaikkia kalentereita tapahtui virhe.";

/* Short description, must be kept short after localization - generic error displayed when sync fails while getting records from phone (contacts and calendars) */
"Error while getting all contacts and calendars." = "Haettaessa kaikkia yhteystietoja ja kalentereita tapahtui virhe.";

/* Short description, must be kept short after localization - generic error displayed when getting all record during sync fails (contacts only) */
"Error while getting all contacts." = "Haettaessa kaikkia yhteystietoja tapahtui virhe.";

/* Short description, must be kept short after localization - error displayed when the Macintosh sync server could not be reached. */
"Error while talking to the Sync Server" = "Viestittäessä synkronointipalvelimen kanssa tapahtui virhe";

/* displayed when phone could not send a message */
"Failed to send message." = "Viestin lähettäminen epäonnistui.";

/* No comment provided by engineer. */
"fax." = "faksi.";

/* displayed when phone refused access to a file */
"File access denied." = "Pääsy tiedostoon estetty.";

/* displayed when a file or directory does not exist on the phone */
"File or directory does not exist." = "Tiedostoa tai hakemistoa ei ole olemassa.";

/* displayed when a file or directory could not be accessed or modified because it was locked */
"File or directory is locked." = "Tiedosto tai hakemisto on lukittu.";

/* No comment provided by engineer. */
"First message from agent on phone was not the expected Version message." = "Puhelimen agentin ensimmäinen viesti ei ollut odotettu versioviesti.";

/* No comment provided by engineer. */
"First message\\U2019s body from agent on phone is malformed." = "Puhelimen agentilta tulleen ensimmäisen viestin vartalo on epämuodostunut.";

/* Short description, must be kept short after localization - error displayed when user has changed something on the phone that he's not supposed to (occurs during pim sync) */
"Forbidden modification made on the phone" = "Puhelimeen on tehty kielletty muutos";

/* No comment provided by engineer. */
"home mobile." = "kotimatkapuhelin.";

/* No comment provided by engineer. */
"home pager." = "kotihakulaite.";

/* recovery message  */
"If this error occurs again, you might need to restart your computer." = "Jos tämä virhe tapahtuu uudelleen, tietokone on ehkä käynnistettävä uudelleen.";

/* recovery suggestiong displayed when is not equiped with bluetooth */
"If you have an external bluetooth adapter, please plug it to your computer." = "Jos omistat ulkoisen Bluetooth-sovittimen, liitä se tietokoneeseen.";

/* Short description, must be kept short after localization - displayed when detected agent on phone is too old */
"Incorrect agent version" = "Virheellinen agentin versio";

/* Short description, must be kept short after localization - generic error */
"Internal error" = "Sisäinen virhe";

/* Short description, must be kept short after localization - generic error. First param is internal error domain, second one is error code */
"Internal error (%@:%d)." = "Sisäinen virhe (%1$@:%2$d).";

/* Short description, must be kept short after localization - generic error */
"Internal error." = "Sisäinen virhe.";

/* Short description, must be kept short after localization - displayed when phone could not send a message because a phone number was not valid */
"Invalid phone number" = "Virheellinen puhelinnumero";

/* Short description, must be kept short after localization - Error displayed when the phone reports user code needs to be entered on the phone */
"Invalid PIN" = "Virheellinen PIN-koodi";

/* Error displayed when the phone reports an invalid SMS configuration */
"Invalid SMS configuration" = "Virheellinen SMS-määrittely";

/* Short description, must be kept short after localization - displayed when phone memory card was not found */
"Memory card not found" = "Muistikorttia ei löytynyt";

/* Error displayed when the phone reports that its onboard memory is full */
"Memory Full" = "Muisti täynnä";

/* Short description, must be kept short after localization - displayed when phone could not send a message */
"Message send failed" = "Viestin lähettäminen epäonnistui";

/* No comment provided by engineer. */
"Negociation with the phone failed." = "Neuvottelu puhelimen kanssa epäonnistui.";

/* Short description, must be kept short after localization - No dataclass is enabled.  There is nothing to sync. */
"No dataclass to sync" = "Ei synkronoitavaa tietoluokkaa";

/* No comment provided by engineer. */
"No matching Operator in database." = "Tietokannassa ei ole vastaavaa operaattoria.";

/* Short description, must be kept short after localization - Error displayed when the phone reports no GSM */
"No network" = "Ei verkkoa";

/* No comment provided by engineer. */
"Obex service was requested while some other service was still using it." = "OBEX-palvelua pyydettiin, kun se oli yhä jonkin toisen palvelun käytössä.";

/* Error string when some operation was aborted */
"Operation canceled." = "Toiminto peruttu.";

/* Short description, must be kept short after localization - error displayed when phone address book memory is full (occurs during pim sync) */
"Phone address book full" = "Puhelimen osoitekirja täynnä";

/* Short description, must be kept short after localization - displayed when phone could not be unmounted because it is used by an other application (like iTunes) */
"Phone busy" = "Puhelin varattu";

/* Short description, must be kept short after localization - error displayed when phone calendar memory is full (occurs during pim sync) */
"Phone calendar full" = "Puhelimen kalenteri täynnä";

/* No comment provided by engineer. */
"Phone can\\U2019t support that service." = "Puhelin ei tue kyseistä palvelua.";

/* Low level phone error */
"Phone Error (AT Controller shutdown)" = "Puhelinvirhe (AT-ohjaimen sammutus)";

/* Low level phone error */
"Phone Error (General Failure)" = "Puhelinvirhe (Yleinen virhe)";

/* Low level phone error */
"Phone Error (Invalid Memory Index)" = "Puhelinvirhe (Virheellinen muistiosoite)";

/* Low level phone error */
"Phone Error (Invalid PDU Mode Parameter)" = "Puhelinvirhe (Virheellinen PDU-tilan parametri)";

/* Low level phone error */
"Phone Error (Invalid Response)" = "Puhelinvirhe (Virheellinen vastaus)";

/* Low level phone error */
"Phone Error (Invalid Text Mode Parameter)" = "Puhelinvirhe (Virheellinen tekstitilan parametri)";

/* Low level phone error */
"Phone Error (Manufacturer Specific Error)" = "Puhelinvirhe (Valmistajakohtainen virhe)";

/* Low level phone error */
"Phone Error (Memory failure)" = "Puhelinvirhe (Muistivirhe)";

/* Low level phone error */
"Phone Error (Memory Full)" = "Puhelinvirhe (Muisti täynnä)";

/* Low level phone error */
"Phone Error (Network Timeout)" = "Puhelinvirhe (Verkon aikakatkaisu)";

/* Low level phone error */
"Phone Error (No Answer)" = "Puhelinvirhe (Ei vastausta)";

/* Low level phone error */
"Phone Error (No Carrier)" = "Puhelinvirhe (Ei valintaääntä)";

/* Low level phone error */
"Phone Error (No Network Service)" = "Puhelinvirhe (Ei verkkopalvelua)";

/* Low level phone error */
"Phone Error (Operation not allowed)" = "Puhelinvirhe (Toiminto ei ole sallittu)";

/* Low level phone error */
"Phone Error (Operation not Supported)" = "Puhelinvirhe (Toimintoa ei tueta)";

/* Low level phone error */
"Phone Error (PH-SIM PIN Necessary)" = "Puhelinvirhe (PH-SIM PIN-koodi vaaditaan)";

/* Low level phone error */
"Phone Error (SIM Busy)" = "Puhelinvirhe (SIM-kortti varattu)";

/* Low level phone error */
"Phone Error (SIM Failure)" = "Puhelinvirhe (SIM-kortin virhe)";

/* Low level phone error */
"Phone Error (SIM Not Inserted)" = "Puhelinvirhe (SIM-korttia ei syötetty)";

/* Low level phone error */
"Phone Error (SIM PIN Necessary)" = "Puhelinvirhe (SIM-kortin PIN-koodi vaaditaan)";

/* Low level phone error */
"Phone Error (SIM Wrong (Error sent by phone)" = "Puhelinvirhe (Väärä SIM-kortti (Puhelimen lähettämä virhe))";

/* Low level phone error */
"Phone Error (SMS Service Reserved)" = "Puhelinvirhe (SMS-palvelu varattu)";

/* Low level phone error */
"Phone Error (SMSC Address Unknown)" = "Puhelinvirhe (Tuntematon SMSC-osoite)";

/* Low level phone error */
"Phone Error (Unknown Error)" = "Puhelinvirhe (Tuntematon virhe)";

/* Unfrequent error */
"Phone is already registered for synchronization." = "Puhelin on jo rekisteröity synkronointia varten.";

/* Short description, must be kept short after localization - displayed when a sync is attempted while phoen is already synchronizing */
"Phone is already synchronizing." = "Puhelinta synkronoidaan jo.";

/* displayed when phone could not be unmounted */
"Phone is being updated by iTunes." = "iTunes päivittää puhelinta.";

/* Short description, must be kept short after localization - displayed when PIM sync failed because the phone is busy or because the synchronization was cancelled on the phone. */
"Phone is busy" = "Puhelin on varattu";

/* displayed when phone could not be unmounted */
"Phone is currently mounted as the disk \\U201C%@\\U201D and could not be ejected." = "Puhelin on tuotu näkyviin levynä ”%@” eikä sitä voitu poistaa näkyvistä.";

/* Short description, must be kept short after localization - displayed when it seems that phone is in a bad state */
"Phone is malfunctioning" = "Puhelin toimii virheellisesti";

/* Short description, must be kept short after localization - displayed when phone is not plugged */
"Phone is not plugged" = "Puhelinta ei ole liitetty";

/* Short description, must be kept short after localization - displayed when phone memory seems in a bad state */
"Phone memory error" = "Puhelimen muistivirhe";

/* Short description, must be kept short after localization - error displayed when phone memory is full (occurs during pim sync) */
"Phone Memory full" = "Puhelimen muisti täynnä";

/* Short description, must be kept short after localization - displayed when a memory volume on the phone is full */
"Phone memory full." = "Puhelimen muisti täynnä.";

/* Short description, must be kept short after localization - displayed when connection to the phone could not be established */
"Phone not found" = "Puhelinta ei löytynyt";

/* Short description, must be kept short after localization - error displayed when phone refused some calendars sent by the mac (occurs during pim sync) */
"Phone refused some calendar events" = "Puhelin hylkäsi jotkin kalenteritapahtumat";

/* Short description, must be kept short after localization - error displayed when phone refused some contacts sent by the mac (occurs during pim sync) */
"Phone refused some contacts" = "Puhelin hylkäsi jotkin yhteystiedot";

/* Short description, must be kept short after localization - error displayed when phone refused some contacts or calendars sent by the mac (occurs during pim sync) */
"Phone refused some contacts or calendar events" = "Puhelin hylkäsi jotkin yhteystiedot tai kalenteritapahtumat";

/* Short description, must be kept short after localization - error displayed when phone task memory is full (occurs during pim sync) */
"Phone task database full" = "Puhelimen tehtävätietokanta on täynnä";

/* Recovery suggestiong displayed when the phone reports user code needs to be entered on the phone */
"Please check that your SIM is valid and correctly inserted." = "Tarkista, että SIM-kortti on kelvollinen ja asetettu oikein paikalleen.";

/* Recovery suggestiong displayed when the phone reports user code needs to be entered on the phone */
"Please check your phone screen and enter your PIN if necessary." = "Tarkista puhelimen näyttö ja syötä tarvittaessa PIN-koodi.";

/* Recovery message proposed to user when phone reports an invalid SMS configuration */
"Please contact your service provider." = "Ota yhteyttä palveluntarjoajaan.";

/* recovery suggestion displayed when phone calendar memory is full (occurs during pim sync) */
"Please delete some calendar events on your phone or change the filtering options and synchronize again." = "Poista kalenteritapahtumia puhelimesta tai muuta suodatusasetuksia ja synkronoi uudelleen.";

/* recovery suggestion displayed when phone Adress book memory is full (occurs during pim sync) */
"Please delete some contacts on your phone or change the filtering options and synchronize again." = "Poista yhteystietoja puhelimesta tai muuta suodatusasetuksia ja synkronoi uudelleen.";

/* displayed when a memory volume on the phone is full */
"Please delete some data on the phone and try again." = "Poista tietoa puhelimesta ja yritä uudelleen.";

/* Recovery message proposed to user when phone reports that its memory is full */
"Please delete some data on your phone and try again." = "Poista tietoa puhelimesta ja yritä uudelleen.";

/* recovery suggestion displayed when phone memory is full (occurs during pim sync) */
"Please delete some data on your phone or change the filtering options and synchronize again." = "Poista tietoa puhelimesta tai muuta suodatusasetuksia ja synkronoi uudelleen.";

/* recovery suggestion displayed when phone task memory is full (occurs during pim sync) */
"Please delete some tasks on your phone or change the filtering options and synchronize again." = "Poista tehtäviä puhelimesta tai muuta suodatusasetuksia ja synkronoi uudelleen.";

/* displayed when connection to the phone could not be established */
"Please make sure that your phone is turned on and try again." = "Varmista, että puhelin on päällä, ja yritä uudelleen.";

/* suggestion displayed when PIM sync failed because phone could not be reached. */
"Please make sure that your phone is turned on. If this error occurs again, please restart your phone." = "Varmista, että puhelin on päällä. Jos tämä virhe tapahtuu uudelleen, käynnistä puhelin uudelleen.";

/* recovery suggestion displayed when phone memory card was not found */
"Please make sure the memory card is correctly inserted in your phone." = "Varmista, että muistikortti on syötetty oikein puhelimeen.";

/* displayed when phone is not plugged */
"Please plug the phone cable on your computer." = "Liitä puhelimen kaapeli tietokoneeseen.";

/* suggestion displayed when agent could not be found on the phone */
"Please reinstall the agent on the phone." = "Asenna agentti uudelleen puhelimeen.";

/* recovery suggestion when it seems that phone is in a bad state */
"Please restart the phone." = "Käynnistä puhelin uudelleen.";

/* recovery suggestion displayed when an error occured while accessing phone internal memory */
"Please restart your phone." = "Käynnistä puhelin uudelleen.";

/* recovery suggestion displayed when we detect bluetooth is off on the computer */
"Please turn on Bluetooth on your computer and retry." = "Laita tietokoneen Bluetooth-ominaisuus päälle ja yritä uudelleen.";

/* displayed when detected agent on phone is too old */
"Please update the agent on the phone." = "Päivitä puhelimen agentti.";

/* No comment provided by engineer. */
"Protocol error while talking to the phone" = "Protokollavirhe viestittäessä puhelimen kanssa";

/* No comment provided by engineer. */
"Requested channel with properties (%@) not found" = "Pyydettyä kanavaa ominaisuuksilla (%@) ei löytynyt";

/* No comment provided by engineer. */
"Service can\\U2019t become functional" = "Palvelu ei voi toimia";

/* No comment provided by engineer. */
"Service depends on other missing service with name: %@" = "Palvelu riippuu toisesta puuttuvasta palvelusta: %@";

/* No comment provided by engineer. */
"Service information in plugin is missing information: %@." = "Pluginin palvelutiedoista puuttuu tieto: %@.";

/* No comment provided by engineer. */
"Service was shutdown." = "Palvelu sammutettiin.";

/* No comment provided by engineer. */
"Service was used while it was not required to become functional" = "Palvelua käytettiin vaikka sen ei vaadittu olevan toiminnassa";

/* Short description, must be kept short after localization - Error displayed when the phone reports an error with SIM */
"SIM error" = "SIM-kortin virhe";

/* No comment provided by engineer. */
"Some operation on channel was launched while channel was not opened." = "Toimintoa käytettiin kanavalla, vaikka kanavaa ei oltu avattu.";

/* Short description, must be kept short after localization - error displayed when PIM sync has been cancelled */
"Synchronization canceled" = "Synkronointi kumottiin";

/* Short description, must be kept short after localization - error displayed when PIM sync has been cancelled on device */
"Synchronization canceled on device" = "Laitteen synkronointi on kumottu.";

/* Short description, must be kept short after localization - error displayed when PIM sync has been cancelled */
"Synchronization canceled." = "Synkronointi kumottiin.";

/* error displayed when PIM sync has been cancelled on device */
"Synchronization has been canceled on device." = "Laitteen synkronointi on kumottu.";

/* error displayed when PIM sync has been cancelled */
"Synchronization has been canceled." = "Synkronointi kumottiin.";

/* Unfrequent error that occurs when contacts or calendar sync is disabled on the phone */
"Synchronization of the following data is disabled on your phone: %@.  Please enable them on your phone, or disable them in iSync." = "Seuraavanlaisen tiedon synkronointi puhelimeen on estetty: %@. Salli tiedon synkronointi puhelimessa tai estä se iSyncissä.";

/* displayed when agent could not be found on the phone */
"The agent could not be found on the phone." = "Puhelimesta ei löytynyt agenttia.";

/* displayed when detected agent on phone is too old */
"The agent on the phone is too old." = "Puhelimen agentti on liian vanha.";

/* displayed when deletion of all record during sync fails (calendars only) */
"The connection to the phone was lost while erasing all the calendar events on the phone." = "Yhteys puhelimeen katkesi poistettaessa kaikkia kalenteritapahtumia puhelimesta.";

/* displayed when deletion of all record during sync fails (calendars and calendars) */
"The connection to the phone was lost while erasing all the contacts and calendar events on the phone." = "Yhteys puhelimeen katkesi poistettaessa kaikkia yhteystietoja ja kalenteritapahtumia puhelimesta.";

/* displayed when deletion of all record during sync fails (contacts only) */
"The connection to the phone was lost while erasing all the contacts on the phone." = "Yhteys puhelimeen katkesi poistettaessa kaikkia yhteystietoja puhelimesta.";

/* displayed when deletion of all record during sync fails (calendars only) */
"The connection to the phone was lost while erasing some calendar events on the phone." = "Yhteys puhelimeen katkesi poistettaessa joitakin kalenteritapahtumia puhelimesta.";

/* displayed when deletion of all record during sync fails (calendars and calendars) */
"The connection to the phone was lost while erasing some contacts and calendar events on the phone." = "Yhteys puhelimeen katkesi poistettaessa joitakin yhteystietoja ja kalenteritapahtumia puhelimesta.";

/* displayed when deletion of all record during sync fails (contacts only) */
"The connection to the phone was lost while erasing some contacts on the phone." = "Yhteys puhelimeen katkesi poistettaessa joitakin yhteystietoja puhelimesta.";

/* generic error displayed when sync fails while getting records from phone  (calendars only) */
"The connection to the phone was lost while getting all the calendar from the phone." = "Yhteys puhelimeen katkesi haettaessa kaikkia kalentereita puhelimesta.";

/* generic error displayed when sync fails while getting records from phone  (calendars and calendars) */
"The connection to the phone was lost while getting all the contacts and events from the phone." = "Yhteys puhelimeen katkesi haettaessa kaikkia yhteystietoja ja tapahtumia puhelimesta.";

/* generic error displayed when sync fails while getting records from phone (contacts only) */
"The connection to the phone was lost while getting all the contacts from the phone." = "Yhteys puhelimeen katkesi haettaessa kaikkia yhteystietoja puhelimesta.";

/* No comment provided by engineer. */
"The connection was lost while deleting some records on the phone." = "Yhteys katkesi poistettaessa joitakin tietueita puhelimesta.";

/* No comment provided by engineer. */
"The connection was lost while getting some records from the phone." = "Yhteys katkesi haettaessa joitakin tietueita puhelimesta.";

/* Error displayed when the physical connection was lost while synchronizing the phone. */
"The connection was lost while talking to the phone." = "Yhteys katkesi viestittäessä puhelimen kanssa.";

/* error displayed when phone address book memory is full (occurs during pim sync) */
"The phone address book is full." = "Puhelimen osoitekirja on täynnä.";

/* displayed when phone is not plugged */
"The phone cable is not plugged." = "Puhelimen kaapelia ei ole liitetty.";

/* error displayed when phone calendar memory is full (occurs during pim sync) */
"The phone calendar is full." = "Puhelimen kalenteri on täynnä.";

/* error displayed when phone refused some calendars sent by the mac (occurs during pim sync) */
"The phone could not store some of your calendar events. The following events will not be synchronized:" = "Puhelin ei voinut tallentaa joitakin kalenteritapahtumia. Seuraavia tapahtumia ei synkronoida:";

/* error displayed when phone refused some contacts or calendars sent by the mac (occurs during pim sync) */
"The phone could not store some of your contacts and calendar events. The following contacts and events will not be synchronized:" = "Puhelin ei voinut tallentaa joitakin yhteystietoja ja kalenteritapahtumia. Seuraavia yhteystietoja ja tapahtumia ei synkronoida:";

/* error displayed when phone refused some contacts sent by the mac (occurs during pim sync) */
"The phone could not store some of your contacts. The following contacts will not be synchronized:" = "Puhelin ei voinut tallentaa joitakin yhteystietoja. Seuraavia yhteystietoja ei synkronoida:";

/* No comment provided by engineer. */
"The phone failed to handle the addition" = "Puhelin ei osannut käsitellä lisäystä";

/* No comment provided by engineer. */
"The phone failed to handle the deletion" = "Puhelin ei osannut käsitellä poistoa";

/* No comment provided by engineer. */
"The phone failed to handle the modification" = "Puhelin ei osannut käsitellä muutosta";

/* error displayed when phone memory is full (occurs during pim sync) */
"The phone memory is full." = "Puhelimen muisti on täynnä.";

/* displayed when a memory volume on the phone is full */
"The phone memory or external memory is full." = "Puhelimen muisti tai ulkoinen muisti on täynnä.";

/* Message displayed to user when phone reports an invalid SMS configuration */
"The phone reports an invalid SMS configuration." = "Puhelimen SMS-määrittely on virheellinen.";

/* Message displayed when the phone reports user code needs to be entered on the phone */
"The phone reports that your PIN is invalid." = "PIN-koodi on virheellinen.";

/* Message displayed when the phone reports user code needs to be entered on the phone */
"The phone reports that your SIM is not working properly." = "Puhelimen SIM-kortti ei toimi oikein.";

/* displayed when it seems that phone is in a bad state */
"The phone seems to be malfunctioning." = "Puhelin toimii virheellisesti.";

/* error displayed when phone task memory is full (occurs during pim sync) */
"The phone task database is full." = "Puhelimen tehtävätietokanta on täynnä.";

/* Error displayed when the connection was lost while getting data from the phone. (occurs during pim sync) */
"There was an error getting data from the phone. The synchronization may have been cancelled on the phone." = "Haettaessa tietoja puhelimesta tapahtui virhe. Synkronointi on saatettu perua puhelimesta.";

/* Error displayed when the connection was lost while sending some changes to the phone. (occurs during pim sync) */
"There was an error pushing some changes to the phone. The synchronization may have been cancelled on the phone." = "Lähetettäessä muutoksia puhelimeen tapahtui virhe. Synkronointi on saatettu perua puhelimesta.";

/* recovery suggestion displayed when phone is in use by iTunes */
"Try again later." = "Yritä myöhemmin uudelleen.";

/* recovery suggestion displayed when phone could not be unmounted */
"Try quitting applications and try again." = "Lopeta ohjelmia ja yritä uudelleen.";

/* displayed when connection to the phone is already in use */
"Try quitting other applications and try again." = "Lopeta muita ohjelmia ja yritä uudelleen.";

/* No comment provided by engineer. */
"Unexpected error accessing files on phone." = "Käytettäessä puhelimessa olevia tiedostoja tapahtui odottamaton virhe.";

/* No comment provided by engineer. */
"Unknown exception." = "Tuntematon poikkeus.";

/* Address Book label of a phone number with video capabilities */
"video." = "videopuhelin.";

/* No comment provided by engineer. */
"work mobile." = "työmatkapuhelin.";

/* No comment provided by engineer. */
"work pager." = "työhakulaite.";

/* Error displayed when the phone reports that its onboard memory is full */
"Your phone memory is full." = "Puhelimen muisti on täynnä.";

